ritikrai10/stm32f4xx_drivers/Src/005button_interrupt.c
/*
 * 005button_interrupt.c
 *
 *  Created on: Sep 11, 2026
 *      Author: ritikrai
 */


/*
 * 002led_button.c
 *
 *  Created on: Sep 4, 2026
 *      Author: ritikrai
 */

#include <string.h>
#include "stm32f407xx.h"

#define HIGH 1
#define LOW 0
#define BTN_PRESSED LOW


void delay(void)
{
	for(uint32_t i = 0 ; i < 500000/2 ; i++);
}



int main(void)
{
	GPIO_handle_t Gpioled , GPIOBtn ;

	memset(&Gpioled,0,sizeof(Gpioled));
	memset(&GPIOBtn,0,sizeof(GPIOBtn));




	Gpioled.pGPIOx = GPIOD;
	Gpioled.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
	Gpioled.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	Gpioled.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_LOW ;
	Gpioled.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP ;
	Gpioled.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;



	GPIO_PeriClockControl(GPIOD,ENABLE);
	GPIO_Init(&Gpioled);

	GPIOBtn.pGPIOx = GPIOD;
	GPIOBtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_5;
	GPIOBtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IT_FT;
	GPIOBtn.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST ;

	GPIOBtn.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;



		GPIO_PeriClockControl(GPIOD,ENABLE);
		GPIO_Init(&GPIOBtn);




		// IRQ CONFIGURATION
		GPIO_IRQPriorityConfig(IRQ_NO_EXTI9_5 , NVIC_IRQ_PRI15 );
		GPIO_IRQInterruptConfig(IRQ_NO_EXTI9_5 , ENABLE );



	while(1);
}


void EXTI9_5_IRQHandler(void)
{
	delay();
	GPIO_IRQHandling(GPIO_PIN_NO_5);
	GPIO_ToggleOutputPin(GPIOD,GPIO_PIN_NO_12);
}

























